// 13. Напишите программу, которая
// выводит третью цифру заданного числа или 
//сообщает, что третьей цифры нет.
//645 -> 5
//78 -> третьей цифры нет
//32679 -> 6


Console.Write("Введите целое число: ");
int number = Convert.ToInt32(Console.ReadLine());

Console.Write(number > 99 ? number.ToString()[2] : '-');
Console. = Console.ReadLine(true);




